; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_2 type_3)
 (:predicates (pred_3 ?v5 - type_2 ?v1 - type_1)
 	      (pred_4 ?v2 - object ?v1 - type_1)
	      (pred_2 ?v5 - type_2 ?v7 - type_3)
	      (pred_1 ?v5 - type_2 ?v2 - object ?v7 - type_3))

   (:action op_2
       :parameters  (?v5 - type_2 ?v4 ?v3 - type_1)
       :precondition (and  (pred_3 ?v5 ?v4))
       :effect (and  (pred_3 ?v5 ?v3)
		     (not (pred_3 ?v5 ?v4))))

   (:action op_1
       :parameters (?v5 - type_2 ?v6 - object ?v8 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_4 ?v6 ?v8) (pred_3 ?v5 ?v8) (pred_2 ?v5 ?v7))
       :effect (and (pred_1 ?v5 ?v6 ?v7)
		    (not (pred_4 ?v6 ?v8)) 
		    (not (pred_2 ?v5 ?v7))))

   (:action op_3
       :parameters (?v5 - type_2 ?v6 - object ?v8 - type_1 ?v7 - type_3)
       :precondition  (and  (pred_1 ?v5 ?v6 ?v7) (pred_3 ?v5 ?v8))
       :effect (and (pred_4 ?v6 ?v8)
		    (pred_2 ?v5 ?v7)
		    (not (pred_1 ?v5 ?v6 ?v7)))))

; problem
(define (problem gripper-2-3-3)
(:domain gripper-strips)
(:objects obj_03 obj_06 - type_2
obj_01 obj_05 obj_11 obj_07 - type_3
obj_02 obj_10 obj_12 - type_1
obj_09 obj_04 obj_08 - object)
(:init
(pred_3 obj_03 obj_10)
(pred_2 obj_03 obj_01)
(pred_2 obj_03 obj_05)
(pred_3 obj_06 obj_10)
(pred_2 obj_06 obj_11)
(pred_2 obj_06 obj_07)
(pred_4 obj_09 obj_02)
(pred_4 obj_04 obj_10)
(pred_4 obj_08 obj_02)
)
(:goal
(and
(pred_4 obj_09 obj_10)
(pred_4 obj_04 obj_10)
(pred_4 obj_08 obj_12)
)
)

(:constraints
  (always (not (pred_3 obj_03 obj_12)))
)
)

; plan
1. (op_2 obj_03 obj_10 obj_02)
   deleted: (pred_3 obj_03 obj_10)
   added: (pred_3 obj_03 obj_02)
   goals met: 1 of 3
2. (op_1 obj_03 obj_08 obj_02 obj_05)
   deleted: (pred_4 obj_08 obj_02) (pred_2 obj_03 obj_05)
   added: (pred_1 obj_03 obj_08 obj_05)
   goals met: 1 of 3
3. (op_1 obj_03 obj_09 obj_02 obj_01)
   deleted: (pred_4 obj_09 obj_02) (pred_2 obj_03 obj_01)
   added: (pred_1 obj_03 obj_09 obj_01)
   goals met: 1 of 3
4. (op_2 obj_03 obj_02 obj_10)
   deleted: (pred_3 obj_03 obj_02)
   added: (pred_3 obj_03 obj_10)
   goals met: 1 of 3
5. (op_3 obj_03 obj_09 obj_10 obj_01)
   deleted: (pred_1 obj_03 obj_09 obj_01)
   added: (pred_4 obj_09 obj_10) (pred_2 obj_03 obj_01)
   goals met: 2 of 3
6. (op_3 obj_03 obj_08 obj_10 obj_05)
   deleted: (pred_1 obj_03 obj_08 obj_05)
   added: (pred_4 obj_08 obj_10) (pred_2 obj_03 obj_05)
   goals met: 2 of 3
7. (op_1 obj_06 obj_08 obj_10 obj_07)
   deleted: (pred_4 obj_08 obj_10) (pred_2 obj_06 obj_07)
   added: (pred_1 obj_06 obj_08 obj_07)
   goals met: 2 of 3
8. (op_2 obj_06 obj_10 obj_12)
   deleted: (pred_3 obj_06 obj_10)
   added: (pred_3 obj_06 obj_12)
   goals met: 2 of 3
9. (op_3 obj_06 obj_08 obj_12 obj_07)
   deleted: (pred_1 obj_06 obj_08 obj_07)
   added: (pred_4 obj_08 obj_12) (pred_2 obj_06 obj_07)
   goals met: 3 of 3
